{
  "productList": [
    {
      "id": 1,
      "title": "Samsung Galaxy S10 G973F Prism White 512GB",
      "photoUrl": "https://cdn.x-kom.pl/i/setup/images/prod/big/product-new-big,,2019/2/pr_2019_2_19_14_29_12_688_06.jpg",
      "description": "Zachwyć się Samsung Galaxy S10 512 GB białym. Smartfonem o niemal bezramkowej konstrukcji z wyświetlaczem Dynamic AMOLED 19:9, zapewniającym doznania wizualne w jakości 2K+. Szerokokątny obiektyw aparatu głównego pozwala na żywe i naturalne ujęcia, bez zniekształceń. Ponadto w razie potrzeby Galaxy S10 bezprzewodowo naładuje inne urządzenia, a znajdujące się na nim dane będą chronione przez pierwszy na świecie ultradźwiękowy czytnik linii papilarnych. Przygotuj się na osiąganie niemożliwego z Galaxy S10.\nSprawdź, jak produkt wygląda w rzeczywistości. Chwyć zdjęcie poniżej i przeciągnij je w lewo lub prawo aby obrócić produkt lub skorzystaj z przycisków nawigacyjnych.",
      "price": 4999,
      "rating": 4
    },
    {
      "id": 2,
      "title": "Huawei Powerbank AP007 13000 mAh srebrny",
      "photoUrl": "https://cdn.x-kom.pl/i/setup/images/prod/big/product-new-big,,2017/7/pr_2017_7_12_10_57_19_456.jpg",
      "description": "Dzięki Power Bankowi Huawei AP007 o pojemności aż 13000 mAh zapewnisz sobie niemal niewyczerpane źródło zasilania dla swoich urządzeń mobilnych. W stylowej aluminiowej obudowie zamknięto nowoczesne ogniwa oraz inteligentne technologie zapewniające wydajność ładowania oraz bezpieczeństwo podłączonych urządzeń. Power Bank wyposażono w dwa złącza USB o napięciu 5V (2A) oraz diody sygnalizujące ilość zmagazynowanej energii.",
      "price": 89,
      "rating": 5
    },
    {
      "id": 3,
      "title": "Dell Inspiron 3780 i5-8265U/8GB/128+1TB/Win10 R520",
      "photoUrl": "https://cdn.x-kom.pl/i/setup/images/prod/big/product-new-big,,2019/3/pr_2019_3_8_13_14_3_421_08.jpg",
      "description": "17-calowy notebook dla całej rodziny. Z procesorami Intel® i szeroką gamą portów. Duży ekran doskonale nadaje się do wspólnego oglądania filmów, a klawiatura numeryczna ułatwia zarządzanie domowym budżetem. Możesz wygodnie przenosić się z między salonem, kuchnią i biurkiem. Wyświetlacz Full HD z powłoką przeciwodblaskową zapewnia wyraźny, jasny i miły dla oka obraz. Technologia IPS odznacza się doskonałą ostrością obrazu pod prawie dowolnym kątem. Możesz podłączyć telewizor lub monitor do portu HDMI, przenosić zdjęcia przy użyciu czytnika kart pamięci i szybko przesyłać dane z dowolnych akcesoriów dzięki dwóm złączom USB 3.1 Gen 1.",
      "price": 3499,
      "rating": 0
    },
    {
      "id": 4,
      "title": "HP OfficeJet Pro 6960",
      "photoUrl": "https://cdn.x-kom.pl/i/setup/images/prod/big/product-new-big,,2017/7/pr_2017_7_6_9_28_23_623.jpg",
      "description": "HP OfficeJet Pro 6960 to urządzenie wielofunkcyjne, które ułatwi pracę w biurze, dzięki drukowaniu w kolorze w przystępnej cenie oraz szybkim operacjom dwustronnym. Automatyczne drukowanie dwustronne pozwoli zaoszczędzić papier oraz wykonać więcej zadań bez spowalniania. Wydajna praca i wykonywanie wielkonakładowych zadań zagwarantowana jest dzięki wszechstronności – drukowaniu, faksowaniu, skanowaniu i kopiowaniu. Wydrukuj nawet pięć razy więcej stron dzięki opcjonalnym, oryginalnym wkładom atramentowym HP o dużej wydajności. Urzadzenie charakteryzuje się profesjonalną jakością kolorów i czarnego tekstu – idealne do drukowania raportów, dokumentów i nie tylko. Oryginalne wkłady atramentowe HP gwarantują drukowanie trwałych dokumentów, które są odporne na wodę, rozmazanie i blaknięcie.",
      "price": 405,
      "rating": 5
    },
    {
      "id": 5,
      "title": "Glorious PC Gaming Race Model O (Matte Black)\n",
      "photoUrl": "https://cdn.x-kom.pl/i/setup/images/prod/big/product-new-big,,2019/3/pr_2019_3_14_10_55_33_758_06.jpg",
      "description": "Zmień oblicze rozgrywki z lekką jak piórko myszą Glorious Model O. Ważąca zaledwie 68 gram, Model O zapewni Ci doskonałe wrażenia podczas gry gwarantując oszałamiającą precyzję i szybkość.\nZaprojektowana przez zespół, który nie akceptuje niczego poza doskonałością - Model O przeniesie Twój gaming na wyższy poziom skuteczności. Pełna kontrola, komfort i niezawodne działanie, niezależnie czy jesteś początkującym czy zawodowym graczem.",
      "price": 219,
      "rating": 2
    },
    {
      "id": 6,
      "title": "OnePlus 6T 8/128GB Dual SIM Midnight Black\n",
      "photoUrl": "https://cdn.x-kom.pl/i/setup/images/prod/big/product-new-big,,2018/10/pr_2018_10_30_8_39_30_127_05.jpg",
      "description": "Poznaj OnePlus 6T 128 Midnight Black. Smartfon z nowatorskim sensorem linii papilarnych, u który został zintegrowany z wyświetlaczem. Niezwykłym, panoramicznym wyświetlaczem AMOLED 6,41”, wypełniającym przedni panel w aż 86%. Z tyłu mieści się podwójny aparat, skonstruowany z myślą o klarownych zdjęciach nocnych. Niezbędną szybkość dostarczają z kolei potężne podzespoły, z 8-rdzeniowym procesorem Snapdragon 845 na czele.\nSprawdź, jak OnePlus 6T 128 GB Midnight Black wygląda w rzeczywistości. Chwyć zdjęcie poniżej i przeciągnij je w lewo lub prawo aby obrócić produkt lub skorzystaj z przycisków nawigacyjnych.",
      "price": 2549,
      "rating": 4
    },
    {
      "id": 7,
      "title": "ASUS VivoBook Pro 15 N580GD i5-8300/16GB/256+1TB/W10",
      "photoUrl": "https://cdn.x-kom.pl/i/setup/images/prod/big/product-new-big,,2019/1/pr_2019_1_11_14_14_51_160_00.jpg",
      "description": "ASUS VivoBook Pro 15 to smukły i lekki laptop o wysokiej wydajności, wyposażony w wyświetlacz obsługujący rozdzielczość FHD i zestaw głośników generujący dźwięk w najwyższej jakości. VivoBook Pro 15 tworzony jest z wysokoodpornościowego aluminium, przechodzącego przez serię szczegółowych procesów technologicznych w celu osiągnięcia smukłej i eleganckiej formy końcowej.\nSprawdź, jak ASUS VivoBook Pro 15 wygląda w rzeczywistości. Chwyć zdjęcie poniżej i przeciągnij je w lewo lub prawo, aby obrócić produkt, lub skorzystaj z przycisków nawigacyjnych. Działaj z maksymalną wydajnością, dzięki mocy procesora Intel Core i5 ósmej generacji. Wprowadza technologię Intel Turbo Boost 2.0, która w inteligentny sposób podnosi taktowanie zegarów, zwiększając natychmiast wydajność CPU oraz dynamikę pracy laptopa. Tworzenie, edycja oraz udostępnianie multimediów, jak i obrazów sferycznych stanie się prostsze i mniej czasochłonne. Zamiast czekać – pracuj. Rób także zakupy w sieci, korzystając z zaawansowanych zabezpieczeń firmy Intel.",
      "price": 4499,
      "rating": 3
    },
    {
      "id": 8,
      "title": "Philips 55PUS7303",
      "photoUrl": "https://cdn.x-kom.pl/i/setup/images/prod/big/product-new-big,,2018/4/pr_2018_4_11_13_54_1_413_01.jpg",
      "description": "Stwórz w swoim domu niepowtarzalny nastrój w czasie każdego seansu z tv Philips 55PUS7303. Technologia Ambilight emitując na ścianę bardzo szeroką poświatę z trzech stron ekranu, tworzy wrażenie że oglądany program wychodzi z ram telewizora i przenosi się wprost do Twojego salonu. Kolory, dynamika i emocje wychodzą Ci na przeciw, aby każdy seans stał się jeszcze bardziej wciągający. Wkrocz w nowy wymiar telewizji z modelem z serii PUS7303. Zobacz na ekranie telewizora 4K obraz równie ostry, jak rzeczywistość. Philips 55PUS7303 Ultra HD ze zwiększoną liczbą pikseli oraz unikatową technologią zwiększania rozdzielczości Ultra Resolution pozwalają uzyskać lepszy obraz w każdej sytuacji.\nJednak zwiększona ostrość to nie wszystko, na 55-calowym ekranie telewizora Philips 55PUS7303 dostrzeżesz także doskonały kontrast, naturalny ruch oraz znakomicie odwzorowane szczegóły. Wszystko to dopełnia jeszcze lepsza głębia obrazu, która sprawia, że przenosisz się w samo centrum akcji.",
      "price": 2698,
      "rating": 4
    },
    {
      "id": 9,
      "title": "MSI Oculux NXG251R czarny 240Hz",
      "photoUrl": "https://cdn.x-kom.pl/i/setup/images/prod/big/product-new-big,,2019/1/pr_2019_1_22_14_45_15_741_00.jpg",
      "description": "Zagraj w najlepsze i najbardziej prestiżowe tytuły gier zaliczane do kategorii AAA na nowoczesnym monitorze gamingowym z technologią NVIDIA G-Sync. Ten piękny, 24,5-calowy monitor, charakteryzuje się częstotliwością odświeżania wynoszącą 240 Hz i 1-milisekundowym czasem reakcji w poziomie. Dzięki temu na monitorze Oculux NXG251R dostrzeżesz swoich przeciwników znacznie szybciej i łatwiej będzie Ci do nich celować.\nSprawdź, jak MSI Oculux NXG251R wygląda w rzeczywistości. Chwyć zdjęcie poniżej i przeciągnij je w lewo lub prawo, aby obrócić produkt, lub skorzystaj z przycisków nawigacyjnych. Technologia NVIDIA G-SYNC zapewnia Ci w grach to, czego potrzebujesz. Płynna i wciągająca rozgrywka pozbawiona efektu rozchodzenia się obrazu. Technologia zmieniająca reguły gry. Częstotliwości odświeżania w zakresie od 0 do 240 Hz, aby zapewnić Ci niezrównaną wydajność. W każdej grze. Za każdym razem.",
      "price": 2499,
      "rating": 5
    }
  ]
}
